'use strict '
//#### - Означает переделанные пункты на новые.

let API_URL = 'https://raw.githubusercontent.com/GeekBrainsTutorial/online-store-api/master/responses';

//------------------------------------------------------
//Создаем экземпляр обьекта
//------------------------------------------------------

const app = new Vue({

	//------------------------------------------------------
	//Привязываем нашу разметку HTML к Vue
	//------------------------------------------------------

	el: '#app',

	// ================================================================
	//#### = Забирамем данные из data и добовляем уже определенному компаненту Cart Product
	// ================================================================

	//------------------------------------------------------
	//Добовляем данные. За это отвечает ключ data
	//------------------------------------------------------

	// data: {
	//Свойсвто для фильтрации.Мы привязываем его к инпуту, чтоб мы знали что пользователь ввел
	// userSearch: '',
	//Отображение корзины. Поумолчанию не активно.
	// showCart: false,
	// cartUrl: '/getBasket.json',
	// catalogUrl: '/catalogData.json',
	// Массив с товарами для корзины
	// cartItems: [],
	//Массив с общими товарами
	// products: [],
	// Отфильтрованный массив 
	// filtered: [],
	//Изображенние для Каталога
	// imgCatalog: 'https://avatarko.ru/img/kartinka/32/Halloween_31492.jpg',
	//Изображение для Корзины
	// imgCart: 'https://avatarko.ru/img/kartinka/32/Halloween_31492.jpg',


	// },

	//------------------------------------------------------
	//Методы 
	//------------------------------------------------------

	methods: {

		//------------------------------------------------------
		//Получение данных от сервера
		//------------------------------------------------------

		// ================================================================
		// ####Product.3.1 = Этот метод он используется глобально длявсех компонентов. его оставляем в нашем приложении
		// ================================================================

		getJson(url) {
			return fetch(url)
				.then(result => result.json())
				.catch(error => {

					// ================================================================
					//####Error.3.4 = если мы получаем ошибку то не будем выводить в консоль, будем обращаться к компаненту ErrorComp
					//####Error.3.4.1 = обращаемся к компаненту и используем метод setError и в качестве ошибки будем передавать ту ошибку которую получили.
					// ================================================================

					// console.log(error);

					this.$refs.error.setError(error);
				})
		},

		// ================================================================
		// ####Cart.2. = Переносим метод добавления и удаления в компанент корзины
		// ================================================================

		//------------------------------------------------------
		// Добавление товаров на страницу
		//------------------------------------------------------

		// addProduct(product) {
		// 	this.getJson(`${API_URL}/addToBasket.json`)
		// 		.then(data => {
		// 			if (data.result === 1) {

		//------------------------------------------------------
		// 				// Просматриваем массив где лежат все продукты и проверяем есть ли данный айди-продукт в данном массиве. Если еть то добовляем его колличество. Если нету то вписываем его
		// 				//метод Find()  он ищет в экземлерах (cartItem) определненные элементы (id)
		//------------------------------------------------------

		// 				let find = this.cartItems.find(el => el.id_product === product.id_product);

		//------------------------------------------------------
		// 				//Если он есть то просто добовляем количество
		//------------------------------------------------------

		// 				if (find) {
		// 					find.quantity++;

		//------------------------------------------------------
		// 					// //Метод updateCart  вносит изменнения на страницу( в корзину)
		//------------------------------------------------------

		// 					// this.updateCart(find);

		// 				} else {

		//------------------------------------------------------
		// 					// Создаем новый обьект и присваеимваем туда новое значение колличество и склеиваим с итерированым product 20 минута 6 урока
		//------------------------------------------------------

		// 					let prd = Object.assign({ quantity: 1 }, product);

		//------------------------------------------------------
		// 					//После создания обьекта мы сможем добавить данные в наш массив cartItem
		//------------------------------------------------------

		// 					this.cartItems.push(prd);

		// 				}
		// 			} else {
		// 				alert('Error');
		// 			}
		// 		})
		// },

		//------------------------------------------------------
		// //Удаление товара
		//------------------------------------------------------

		// remove(item) {

		//------------------------------------------------------
		// 	// Делаем запорос на сервер
		//------------------------------------------------------

		// 	this.getJson(`${API_URL}/deleteFromBasket.json`)
		// 		.then(data => {
		// 			if (data.result === 1) {

		//------------------------------------------------------
		// 				// Product и есть массив и Мы можем сразу обратиться к нему и внем искать нужные нам данные. Проверяем какое количество у нас есть товара\\\
		//------------------------------------------------------

		// 				if (item.quantity > 1) {
		// 					item.quantity--;
		// 				} else {

		//------------------------------------------------------
		// 					//Удаляем товар  с помощью метода splice первый аргумент (элемент который нужно удалить)
		//------------------------------------------------------

		// 					this.cartItems.splice(this.cartItems.indexOf(item), 1)
		// 				}
		// 			}
		// 		})
		// },

		//------------------------------------------------------
		//метод фильтр
		//------------------------------------------------------

		// ================================================================
		//####Product.3.1 = Забираем и переносим в ProductComp
		// ================================================================

		// filter() {

		//------------------------------------------------------
		// 	//Формируем новое регуялрное выражение - это новый экземпляр RegExp
		//------------------------------------------------------

		// 	let regexp = new RegExp(this.userSearch, 'i');

		//------------------------------------------------------
		// 	//Изменяем массив фильтред. Мы будем отображать товары с массива. Фильтруем товары из Продуктс и помещаем их в Фильтеред
		//------------------------------------------------------

		// 	this.filtered = this.products.filter(el => regexp.test(el.product_name))
		// },
	}

	//------------------------------------------------------
	//Когда все готово на странице, то Vue понимает что надо отправлять запрос и вызывать метод getJson
	//------------------------------------------------------

	// mounted() {

	//------------------------------------------------------
	// 	//получаем URL
	//------------------------------------------------------

	// ================================================================
	// 	//####Product.2.1 = Переносим в ProductComp mounted()
	// ================================================================

	// 	// this.getJson(`${API_URL + this.catalogUrl}`)

	//------------------------------------------------------
	// 	// 	// получаем данные с URL
	//------------------------------------------------------

	// 	// 	.then(data => {

	//------------------------------------------------------
	// 	// 		//Итерируем, перебераем данные
	//------------------------------------------------------

	// 	// 		for (let el of data) {

	//------------------------------------------------------
	// 	// 			// добовляем в массив с товарами
	//------------------------------------------------------

	// 	// 			this.products.push(el);

	//------------------------------------------------------
	// 	// 			// добовляем в массив для фильтрации данных (поиск по сайту)
	//------------------------------------------------------

	// 	// 			this.filtered.push(el);
	// 	// 		}
	// 	// 	});

	//------------------------------------------------------
	// 	// Получения url
	//------------------------------------------------------

	// ================================================================
	// 	// ####Cart.5.2 = забираем этот метод и добовляем его к компаненту корзины
	// ================================================================

	// 	// this.getJson(`${API_URL + this.cartUrl}`)
	//------------------------------------------------------
	// 	// 	// получаем данные с URL
	//------------------------------------------------------

	// 	// 	.then(data => {

	//------------------------------------------------------
	// 	// 		// Итерируем, перебераем данные
	//------------------------------------------------------

	// 	// 		for (let el of data.contents) {

	//------------------------------------------------------
	// 	// 			// добовляем в массив
	//------------------------------------------------------

	// 	// 			this.cartItems.push(el);
	// 	// 		}
	// 	// 	})
	// },

})
